Repository: evias/eViasWeb
Catalog: application/locales/*/*.po
Languages: de, fr

# __HOME_PAGE_TITLE__
source: C / C++ / PHP (4-5) / Javascript Developper
de: C / C++ / PHP (4-5) / Javascript Programmierer
fr: Développeur C / C++ / PHP (4-5) / Javascript

# __HOME_PAGE_FIRST_P__
source: Welcome to my personal web site. eViasWeb is an Open Source web platform which you can download the source code of at <a href="http://github.com/evias/eViasWeb">its GIT repository</a>.
de: Ich heiße Sie herzlich Wilkommen auf meiner Webseite. Diese dient dazu meine Hauptprojekte vorzustellen. Die Seite wird als Open Source veröffentlicht, Sie können die Quellcode Dateien <a href="http://github.com/evias/eViasWeb">hier</a> downloaden.
fr: Je vous souhaite la bienvenue sur mon site web personnel. Il s'agit d'une plateforme de développement open source. Il est en effet possible de télécharger le code source de cette application depuis <a href="http://github.com/evias/eViasWeb">le dépôt GIT public</a>.

# __HOME_PAGE_SECOND_P__
source: My personal informations, my resume and my references are public content and you can always access them. You can contact me for any development task using the 'Contact me' part of this website. Any development job requires a specific and clear case study, which means the reply delay may vary between 1 to 3 days, I ask you to accept this.
de: Meine persönlichen Angaben, mein Lebenslauf und meine Referenzen sind für jeden zugänglich. Das 'Contact me' Tab dient dazu Ihnen bei Ihrer Anfrage an mir zu helfen indem es manche oft vorkommende Informationen von sich ausfüllt. Eine Web oder Software Entwicklung Anfrage erfordert immer eine spezifische und klare Fall Studie. Dies kann dazu führen dass meine Antwortszeit von 1 bis zu 3 Tage variiert.
fr: L'accès à mes informations personnelles, mon CV et mes références est public. Il vous est également possible de me contacter via l'onglet Contact. Toute demande de développement nécessite une étude de cas précise, je vous demande donc d'accepter un délai de 1 à 3 jour(s) pour répondre à votre demande.

# __HOME_PAGE_THIRD_P__
source: The modules shown on this platform can not be considered as finished work. They are mostly integrated to the platform for production test purposes. By now, only members can access those implemented modules. This should be changed as soon as the security level has been increased.
de: Die zugängliche Module sind nicht mit ausgereifte Entwicklungen zu vergleichen. Eine Erscheinung von einem Modul auf diese Plattform gleicht einen Produktion Test des Moduls. Bis jetzt können nur Mitglieder der Plattform diese Features sehen, dies sollte sich jedoch ändern sobald die Sicherheit Maßnahmen ausreichend getestet wurden.
fr: Tout développement publié sur la plateforme eViasWeb ne peut être considérer comme développement fini. Une publication sur cette plateforme équivaut à une mise en test d'un module sur un environnement de production. Pour l'instant, seul les membres ont accès à la plupart des modules implémentés. Un accès unanime est prévu dès lors que les tests de sécurités auront été portés a bien.

# __SIGNATURE__
source: Sincerely, <br /><br />SAIVE Grégory
de: Mit freundlichen Grüßen, <br /><br />SAIVE Grégory
fr: Amicalement, <br /><br />SAIVE Grégory

# __MENU_LINK_HOME__
source: Home
de: Startseite
fr: Accueil

# __MENU_LINK_INFO__
source: Personal informations
de: Persönliche Angaben
fr: Informations personnelles

# __MENU_LINK_PRESENT__
source: Articles
de: Artikel

# __MENU_LINK_WIDGETGALLERY__
source: Widgets gallery
de: Widgetsgallerie
fr: Galerie de Widgets

# __MENU_LINK_MEMBER__
source: Member panel
de: Mitglied Panel
fr: Panel membre

# __PLATFORM_FOOTER_TEXT__
source: eViasWeb - A development by <a href="mailto:saive.gregory@gmail.com">Grégory Saive</a>
de: eViasWeb - Eine Entwicklung von <a href="mailto:saive.gregory@gmail.com">Grégory Saive</a>
fr: eViasWeb - Un développement de <a href="mailto:saive.gregory@gmail.com">Grégory Saive</a>

# __INFO_PAGE_TITLE__
source: Personal informations
de: Persönliche Angaben
fr: Informations personnelles

# __INFO_FIRST_TABLE_TITLE__
source: Contact / Person
de: Kontakt Angaben
fr: Coordonnées civiles

# __INFO_NAME__
source: Last name:
de: Name:
fr: Nom:

# __INFO_FIRSTNAME__
source: First name:
de: Vorname:
fr: Prénom:

# __INFO_TELEPHONE__
source: Phone:
de: Tel.:
fr: Tél.:

# __INFO_SECOND_TABLE_TITLE__
source: Offered skills:
de: Angebotene Fähigkeiten:
fr: Compétences proposées

# __INFO_LANGUAGES__
source: Languages:
de: Programmiersprachen:
fr: Langages:

# __INFO_COMPETENCES__
source: Skills:
de: Fähigkeiten:
fr: Compétences:

# __INFO_DATA_COMPETENCES__
source: Back-end development, Front-end Javascript development, application architecture, database modeling, Software server installations
de: Back-end Entwicklungen, Front-End Javascript Entwicklungen, Programm Architektur, Datenbank design, Installation von Software server
fr: Développements back-end, développements Javascript, architecture applicative, conception de base de données, mise en place de serveurs applicatifs.

# __INFO_THIRD_TABLE_TITLE__
source: Web development
de: Entwicklung von Webprogramme
fr: Développement web

# __INFO_FOURTH_TABLE_TITLE__
source: Desktop development
de: Entwicklung von Desktopprogramme
fr: Développement logiciel

# __INFO_DATA_WEBDEV_1__
source: 5 years ago I discovered the PHP language and its easy-to-use features. I am now able to confirm a very advanced skill using PHP. Although PHP will cover loads of features, it is not possible, using PHP, to develop a user friendly, dynamic interface. Which is why I have been using Javascript for about 3 years. The new HTML5 and CSS3 standards could change a lot in the manner of developing a web application, and so I have also been studying these new standards.
de: Vor fünf Jahren ungefähr habe ich diese neue Art Programme frei zu geben kennen gelernt. Es ist jetzt möglich aus einer Webseite, eine komplette Anwendung zu machen. Mit sogenannten Script Sprachen wie PHP und Javascript, ist es durchaus möglich Programme zu enwickeln, die deren Desktop Konkurrenten in jeder hinsicht ausgleichen, und manchmal sogar übertreffen.
fr: J'ai découvert le monde des applications web il y a maintenant 5 ans. Je suis heureux d'annoncer avoir acquit les connaissances requises aux développement d'applications web actuelles (PHP5 / Javascript / HTML5 / CSS3). Les plateformes applicatives sont en constante évolution et les navigateurs ne cessent d'évoluer.

# __INFO_DATA_WEBDEV_2__
source: The new web application development standards may revolution these given applications. Any web developer is now able to develop friendly interfaces and improve the user experience on their site, by following the correct HTML5 and CSS3 standards. Not only will it give us developers a better and easier way to publish our works, but it will also allow us to develop web applications, near to be as user friendly as Desktop applications .
de: Die neusten Web standards erlauben uns Developpers, konkrete User Interfaces (häufig UI gennant) zu entwickeln. Dank der neuen Technologie ist es Heut-zutage einfach, dynamische und ergonomische Anwendungen frei zu geben.
fr: C'est pourquoi il est nécessaire de suivre l'actualité des technologies Web. Les nouveaux standard concernant HTML5, CSS3 et les nouvelles API Javascript permettent de développer des produits applicatifs tout aussi ergonomiques et dynamiques que les applications de bureau que vous connaissez.

# __INFO_DATA_WEBDEV_3__
source: Web developments are popular because of their small development delay and because of their everywhere-usability. You, indeed, only need a browser, as in Mozilla Firefox, Google Chrome or Internet Explorer to execute these applications.
de: Die Entwicklungszeit solcher Anwendungen ist kürzer als bei Desktop Programme und eine Web Anwendung ist immer ausführbar, wenn man einen Browser besitzt. (Mozilla Firefox, Google Chrome, Internet Explorer,...)
fr: Les développements d'applications web sont souvent moins couteux en temps de développement et plus appréciés pour leur exécution simple à l'aide de navigateurs tels Mozilla Firefox, Google Chrome ou encore Internet Explorer.

# __INFO_DATA_APPDEV_1__
source: I started developping desktop applications as I was 12 years old. I used to develop applications using C / Win32 and C++ / Qt. By now, I can interact on many more sectors of the desktop application development. As I have been working with multi-threading, database optimizations and project architecture, I am now able to develop any of your software needs.
de: Im laufe des Jahre 2000 (mit 12 also), habe ich angefangen Desktop Programme mit C / Win32 und C++ / Qt zu entwickeln. Jedoch war ich noch jung und die Anwendungen waren nur klein und nutzlos, für das Meiste.
fr: J'ai fait mes débuts en développement logiciel à l'âge de 12 ans (en l'an 2000) par des petits logiciels utilitaires développés en C et C++ avec, respectivement l'API Win32 et Qt.

# __INFO_DATA_APPDEV_2__
source: Desktop applications require a longer development delay and they need a good kernel to be developped upon. In order to secure the application, there is a need of a library that will cover most of the daily desktop application development tasks.
de: Sobald die Programme, die man entwickelt, ein größeres Maß an Verantwortung betreffen, ist es wichtig eine Sekurisierte und klare Anwendungsbasis zu haben.
fr: Dès lors que les applications demandées sont plus conséquentes en responsabilités et plus longues à développer, il est nécessaire de mettre en place un noyau d'application efficace et simple.

# __INFO_DATA_APPDEV_3__
source: Which is the reason why I have been developing my C++ library for about 2 years now. This library stands for an easier, faster, simpler and more effective way of deploying and developing applications. As far as it will summarize a desktop application's development to the development of business layers and user interfaces. This reduces the delay of development of some important days.
de: Deswegen habe ich mich in den letzten 2 Jahre damit beschäftigt, eine Bibliothek zu entwickeln, die mir dabei hilft meine Entwicklungszeit zu verkleinern. Wenn diese Basis benutzbar ist, wird das Entwickeln von Programme nämlich nur noch damit zusammengefasst dass man die verschiedenen Business Schichten und die UIs zu entwickeln hat. Auf dieser Hinsicht wird die Entwicklungszeit um einiges gekürzt.
fr: C'est pourquoi je me suis concentré pendant 2 ans sur un développement de librairie utilitaire qui me permettrait de développer rapidement tout projet logiciel. Ayant mis en place ce noyau, les développements de projets se résument à l'implémentation de différentes couches commerciales et interfaces utilisateurs. Le délai de développement d'une application se voit ainsi réduit d'un nombre important de jours de travail.

# __URL_REWRITE_BLOG_HOME__
source: Accueil des articles
de: Artikel Startseite

# __URL_REWRITE_PERSONAL_INFO__
source: Informations personnelles
de: Persönliche Angaben

# __URL_REWRITE_BLOG_MEMBERS__
source: Membres du blog
de: Mitglieder
fr: Membres

# __URL_REWRITE_BLOG_WRITE__
source: Ajouter un article
de: Artikel hinzufügen

# __URL_REWRITE_BLOG_ADMIN__
source: Gestion des articles
de: Artikel Verwaltung

# __PLATFORM_HEADER_TEXT__
source: eViasWeb - Open Source Development Platform
fr: eViasWeb - Plateforme de développement Open Source

# __INFO_SGBD__
source: DBMS:
fr: SGBD:

# __INFO_LIBS_CPP__
source: C++ libraries/API:
fr: Librairies/API C++:

# __INFO_LIBS_PHP__
source: PHP libraries/API:
fr: Librairies/API PHP:

# __INFO_LIBS_JS__
source: Javascript libraries:
fr: Librairies Javascript:
